//Створіть дві змінні для зберігання значень двох текстових полів. Перевірте, чи обидві змінні не є порожніми. Якщо обидва поля заповнені, вивести повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".
const text1 = prompt("Введи текст ");
const text2 = prompt("Введи текст ");
if (text1 !== "" && text2 !== "") {
    console.log("Всі поля заповнені");
} else {
    console.log("Не всі поля заповнені! Перевірте");
}



//Створіть дві змінні для зберігання числових значень. Обчисліть їх суму. Якщо сума більше 10 — виведіть "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".
const numberone = Number(prompt("Введи перше число")); 
const numbertwo = Number(prompt("Введи 2 число")); 
if (numberone + numbertwo > 10) {
    console.log("Сума більша ніж десять");
} else {
    console.log("Сума менша чи дорівнює десяти");
}




//Створіть змінну для зберігання тексту. Перевірте, чи містить цей текст слово "JavaScript". Якщо містить, виведіть "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".
const text = prompt("Введи текст");
if (text === "JavaScript") {
    console.log("В тексті є слово JavaScript");
} else {
    console.log("В тексті немає  слова JavaScript");

}





//Створіть змінну для зберігання числа. Перевірте, чи це число більше 10 і менше 20. Якщо так — виведіть "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".
const number = Number(prompt("Введи число"));
if (10 <= number && number <= 20) {
    console.log("Число  в діапазоні від 10 до 20");
} else {
    console.log("Число не в діапазоні від 10 до 20");
}





//Створіть змінні для зберігання значень полів (ім'я, email, пароль). Перевірте, чи ім'я містить не менше 3 символів, чи email містить символ @ та крапку після нього, а пароль не менше 6 символів. Якщо всі умови виконані — виведіть "Перенаправлення на іншу сторінку", якщо ні — "Помилка: неправильне заповнення".
const login = prompt("Введи своє  ім'я");
const email = prompt("Введіть свій email");
const pasword = prompt("Введіть свій пароль");
if (login.length >= 3 && email.includes("@.") && pasword.length >= 6) {
    console.log("Перенаправляємо вас на іншу сторінку...");
} else {
    console.log("Помилка (неправильне введення)");

    
}